#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Мама', 'Папа', 'Я', 'Бабушка']

# список списков приблизительного роста членов вашей семьи
my_family_height = [
    ['Мама', 168],
    ['Папа', 182],
    ['Я', 175],
    ['Бабушка', 160],
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
father_height = my_family_height[1][1]
print(f'Рост отца - {father_height} см')

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
total_height = sum(member[1] for member in my_family_height)
print(f'Общий рост моей семьи - {total_height} см')